W9D5_RAILS/music_app/app/controllers/bands_controller.rb

  def show
    @band = Band.find(params[:name])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @band = current_user.bands.new(band_params)

    if @band.save
---
INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "What are pickles?"], ["created_at", "2019-07-28 19:26:40.856413"], ["updated_at", "2019-07-28 19:26:40.856413"]]

  def edit
    @band = Band.find(params[:name])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]