W9D5_RAILS/music_app/app/models/user.rb

  def reset_session_token
    self.session_token = User.generate_session_token
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "rfbJu-jcYnYrA1EdUNIMqg"], ["updated_at", "2019-07-28 02:10:18.303403"], ["id", 1]]